SROP6313/Arduino-underwater-ROV/SPI/ESP32_Webcombine/src/main.cpp
#include <Arduino.h>
#include <SPI.h>
#include <WiFi.h>
#include <Wire.h>
#include <WiFiClient.h>
#include <WebServer.h>
#include <esp32-hal-ledc.h>      //用於控制伺服馬達
#include "soc/soc.h"             //用於電源不穩不重開機 
#include "soc/rtc_cntl_reg.h"    //用於電源不穩不重開機

//官方函式庫
#include "esp_http_server.h"     //HTTP Server函式庫
#include "esp_timer.h"
#include "Arduino.h"
#include "fb_gfx.h"

#include "MS5837.h"

WebServer server(80);

// Replace with your network credentials
const char* ssid = "Huawei P30";
const char* password = "ys771u9o";

#define I2C_SDA 21  //to sensor white
#define I2C_SCL 22  //to sensor green

#define ESP32_CAM_SCK 14   //to Mega pin 52
#define ESP32_CAM_MISO 12  //to Mega pin 50
#define ESP32_CAM_MOSI 13  //to Mega pin 51
#define ESP32_CAM_SS 2     //to Mega pin 53

#define LED_PIN 27

httpd_handle_t camera_httpd = NULL;

static const char PROGMEM INDEX_HTML[] = R"rawliteral(
<html>
  <head>
    <meta charset="utf-8">
    <title>ROV underwater view</title>
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <style>
      body { font-family: Arial; text-align: center; margin:0px auto; padding-top: 30px;}
      table { margin-left: auto; margin-right: auto; }
      td { padding: 8 px; }
      img {  
        transform: rotate(90deg);
        width: 380px ;
        max-width: 100% ;
        height: 320px ;  
      }
     .btn-group1 .buttonFrwBkw {
        background-color: #669999;
        border: 1px solid white;
        color: white;
        padding: 15px 32px;
        text-align: center;
        text-decoration: none;
        display: inline-block;
        font-size: 16px;
        cursor: pointer;
        float: left;
        transition-duration: 0.4s;
        width: 100%;
        font-family:Microsoft JhengHei;
      }      
      .btn-group3 .buttonRL {
        background-color: #669999;
        border: 1px solid white;
        color: white;
        padding: 15px 30px;
        text-align: center;
        text-decoration: none;
        display: inline-block;
        font-size: 16px;
        cursor: pointer;
        float: left;
        width: 33.3%;
        transition-duration: 0.4s;
        font-family:Microsoft JhengHei;
      }
      .btn-group3 .buttonStp {
        background-color: LightSlateGrey;
        border: 1px solid white;
        color: white;
        padding: 15px 30px;
        text-align: center;
        text-decoration: none;
        display: inline-block;
        font-size: 16px;
        cursor: pointer;
        float: left;
        width: 33.3%;
        transition-duration: 0.4s;
        font-family:Microsoft JhengHei;
      }
      .btn-group2 .buttonRsDv {
        background-color: #7c9ccd;
        border: 1px solid white;
        color: white;
        padding: 15px 32px;
        text-align: center;
        text-decoration: none;
        display: inline-block;
        font-size: 16px;
        cursor: pointer;
        float: left;
        transition-duration: 0.4s;
        width: 50%;
        font-family:Microsoft JhengHei;
      }
      .btn-group2 .buttonHdAm {
        background-color: #d4aa5c;
        border: 1px solid white;
        color: white;
        padding: 15px 1px;
        text-align: center;
        text-decoration: none;
        display: inline-block;
        font-size: 16px;
        cursor: pointer;
        float: left;
        transition-duration: 0.4s;
        width: 25%;
        font-family:Microsoft JhengHei;
      }
      .btn-group4 .buttonStb {
        background-color: DarkSalmon;
        border: 1px solid white;
        color: white;
        padding: 10px;
        text-align: center;
        text-decoration: none;
        display: inline-block;
        font-size: 16px;
        cursor: pointer;
        float: left;
        transition-duration: 0.4s;
        width: 33.33%;
        margin: 10px 0 0 0;
        font-family:Microsoft JhengHei;
      }
      .card{
        max-width: auto;
        min-height: auto;
        background: #6175a1;
        text-align: center;
        margin: 20px auto;
        padding: 10px;
        box-sizing: border-box;
        color: #FFF;
        box-shadow: 0px 2px 18px -4px rgba(0,0,0,0.75);
        font-family:Microsoft JhengHei;
      }
      ul {
        list-style-type: none;
        margin: 0;
        padding: 0 25px;
        overflow: hidden;
        background-color: #333;
        position: -webkit-sticky; 
        position: sticky;
        top: 0;
      }
      li {
        float: left;
      }
      li a {
        display: block;
        color: white;
        text-align: center;
        padding: 14px 16px;
        text-decoration: none;
      }
      
      body {
        font-family: Arial;
      }
                
      .progress {
        position: absolute;
        top: 830px;
        width: 0%;
        height: 10px;
        background-color: #2183DD;
        transition: width 0.2s;
      }
      .progress.progress--1 {
        width: calc(14.3%);
      }
      .progress.progress--2 {
        width: calc(28.6%);
      }
      .progress.progress--3 {
        width: calc(42.9%);
      }
      .progress.progress--4 {
        width: calc(57.2%);
      }
      .progress.progress--5 {
        width: calc(71.5%);
      }
      .progress.progress--6 {
        width: calc(85.8%);
      }
      .progress.progress--7 {
        width: calc(100%);
      }
      .progress.progress--complete {
        width: 100vw;
      }
      
      .progress__bg {
        position: absolute;
        width: 100vw;
        height: 10px;
        background-color: #E5E5E5;
        z-index: -1;
      }
      
      .progress__step {
        position: absolute;
        top: -8px;
        left: 0;
        display: flex;
        flex-direction: column;
        align-items: center;
        text-align: center;
      }
      .progress__step.progress__step--1 {
        left: calc(14.3vw - 9px);
      }
      .progress__step.progress__step--2 {
        left: calc(28.6vw - 9px);
      }
      .progress__step.progress__step--3 {
        left: calc(42.9vw - 9px);
      }
      .progress__step.progress__step--4 {
        left: calc(57.2vw - 9px);
      }
      .progress__step.progress__step--5 {
        left: calc(71.5vw - 9px);
      }
      .progress__step.progress__step--6 {
        left: calc(85.8vw - 9px);
      }
      .progress__step.progress__step--7 {
        left: calc(100vw - 9px);
      }
      .progress__step.progress__step--active {
        color: #2183DD;
        font-weight: 600;
      }
      .progress__step.progress__step--complete .progress__indicator {
        background-color: #009900;
        border-color: #2183DD;
        color: #FFFFFF;
        display: flex;
        align-items: center;
        justify-content: center;
      }
      .progress__step.progress__step--complete .progress__indicator .fa {
        display: block;
      }
      .progress__step.progress__step--complete .progress__label {
        font-weight: 600;
        color: #009900;
      }
      
