SROP6313/Arduino-underwater-ROV/SPI/ESP32_Webcombine/src/main.cpp
      .progress__indicator {
        width: 25px;
        height: 25px;
        border: 2px solid #808080;
        border-radius: 50%;
        background-color: #FFFFFF;
        margin-bottom: 10px;
      }
      .progress__indicator .fa {
        display: none;
        font-size: 16px;
        color: #FFFFFF;
      }
      
      .progress__label {
        position: absolute;
        font-size: 10px;
        top: 40px;
      }
      
      .progress__actions {
        position: absolute;
        top: 75px;
        left: 10px;
        display: flex;
        align-items: center;
        width: max-content;
      }
      
      .btn {
        width: fit-content;
        padding: 5px 8px;
        background-color: #FFFFFF;
        border: 1px solid #808080;
        border-radius: 5px;
        cursor: pointer;
        user-select: none;
        visibility: hidden;
      }
      .btn:nth-child(2) {
        margin: 0 10px;
      }
    </style>
    <h1 style="color:steelblue; font-family:Microsoft JhengHei">水下觀察機</h1>
    <link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css'>
    <i id="battery" class='fa fa-battery-0' style="font-size:50px; position:absolute; top:27px; right:12px;"></i>
    <ul>
      <li><a href="#photo">水下影像</a></li>
      <li><a href="#control">控制</a></li>
      <li><a href="#feedback">數值</a></li>
    </ul>
    <p id="photo"></p>
    <iframe
      noresize="noresize"
      style="position: middle; background: transparent; width: 100%; height:320px;"
      src="http://192.168.43.237/">
    </iframe>
    <div class="btn-group1">
      <button id="control" class="buttonFrwBkw" onclick="toggleCheckbox('forward');">加速</button>
    </div>
    <div class="btn-group3">
      <button class="buttonRL" onclick="toggleCheckbox('left');">左轉</button>
    </div>
    <div class="btn-group3">
      <button class="buttonStp" onclick="toggleCheckbox('stop');">停止</button>
    </div>
    <div class="btn-group3">
      <button class="buttonRL" onclick="toggleCheckbox('right');">右轉</button>
    </div>
    <div class="btn-group1">
      <button class="buttonFrwBkw" onclick="toggleCheckbox('backward');">減速</button>
    </div>
       <div class="btn-group2">
      <button class="buttonRsDv" onclick="toggleCheckbox('rise');">上升</button>
      <button class="buttonRsDv" onclick="toggleCheckbox('dive');">下潛</button>
    </div>
    <div class="btn-group2">
      <button class="buttonHdAm" onclick="toggleCheckbox('hold');">抓住</button>
      <button class="buttonHdAm" onclick="toggleCheckbox('release');">放開</button>
      <button class="buttonHdAm" onclick="toggleCheckbox('armup');">手臂抬升</button>
      <button class="buttonHdAm" onclick="toggleCheckbox('armdown');">手臂下降</button>
    </div>
    <div class="btn-group4">
    <button class="buttonStb" style="vertical-align:middle; padding:16.5px;" onclick="toggleCheckbox('light');"><span>燈光</span></button>
    <button class="buttonStb" style="vertical-align:middle; padding:16.5px;" onclick="toggleCheckbox('stable');"><span>穩定機身</span></button>
    <button class="buttonStb" style="vertical-align:middle; padding:6px;" ondblclick="toggleCheckbox('reset');"><span>重置陀螺儀(雙擊)</span></button>
    </div>
    <p><br></p>
    <script src="https://cdn.jsdelivr.net/npm/vue/dist/vue.js"></script>
      <div id="app" :class="progressClasses">
        <div class="progress__bg"></div>
        <template v-for="(step, index) in steps">
          <div :class="stepClasses(index)">
            <div class="progress__indicator">
                <i class="fa fa-check"></i>
            </div>
            <div class="progress__label">
                {{step.label}}
            </div>
          </div>
        </template>
        
        <div class="progress__actions">
          <div
          class="btn"
          v-on:click="nextStep(false)"
          >
          Back
          </div>
          <div
          class="btn"
          id = "NS"
          v-on:click="nextStep"
          >
          Next
          </div>
        </div>
      </div>
    
    <p style="clear:both"><br></p>
    <p style="clear:both"><br></p>
    <div class="card">
      <h2 id="feedback">感測器數值</h2><br>
      <h4>Temperature : <span id="temperValue"></span> (degree C) </h4><br>
      <h4>Pressure : <span id="pressureValue"></span> (mbar) </h4><br>
    </div>
  <script>
    function toggleCheckbox(x) {
      var xhr = new XMLHttpRequest();
      xhr.open("GET", "/action?go=" + x, true);
      xhr.send();
    }
    window.onload = document.getElementById("photo").src = window.location.href.slice(0, -1) + ":81/stream";

    setInterval(function() {
      getTemper();
      getPressure();
    }, 2000); //1ms update rate 太短可能導致按鈕失靈(經測試50不錯)
    setInterval(function() {
      getWarn();
    }, 3000);
    setInterval(function(){
      getSpeedstatus();
      sampleClick();
    },500);
    setInterval(function(){
      getBatstatus();
    },9250);
   
    function sampleClick() {
      var btnX = document.getElementById("NS");
      btnX.click();
    }
   
    var warn;
    function getTemper() {
      var xhttp = new XMLHttpRequest();
      xhttp.onreadystatechange = function() {
        if (xhttp.readyState == 4 && xhttp.status == 200) {
          document.getElementById("temperValue").innerHTML = xhttp.responseText;
        }
      };
      xhttp.open("GET", "readTemper", true);
      xhttp.send();
    }
    function getPressure() {
      var phttp = new XMLHttpRequest();
      phttp.onreadystatechange = function() {
        if (phttp.readyState == 4 && phttp.status == 200) {
          document.getElementById("pressureValue").innerHTML = phttp.responseText;
        }
      };
      phttp.open("GET", "readPressure", true);
      phttp.send();
    }
    
    function getWarn() {
      var warnhttp = new XMLHttpRequest();
      warnhttp.onreadystatechange = function() {
        if (warnhttp.readyState == 4 && warnhttp.status == 200) {
          warn = parseInt(warnhttp.responseText);
          console.log(warn);  //主控台顯示warn值
          if(warn == 1 )
          {
            alert("警告!訊號過低");
          }
          if(warn == 3)
          {
            alert("警告!電池電壓過低");
          }
        }
      };      
      warnhttp.open("GET", "readWarn", true);
      warnhttp.send();
    }
    
